@extends('layouts/app')
@section('content')

<br><br>
<h2>О сайте</h2>
    <div class="add-question">
           
        <p>
            Здесь вы можете, разместить свой вопрос, про ПДД, тоже самое, что и в билетах, 
            только с возможностью того места, которое вас интересует.
        </p>
        <br>
        <p>
        Так же, вы можете оставлять комментарии к вопросу, спорить с тем, кто придумал 
        этот вопрос, что он не прав или окажется, что после спора, вы не правы и добавлять вопрос в закладки, что бы потом
        его не искать.
        </p>
    </div>



@endsection
