<?php

use Illuminate\Database\Seeder;
use App\Sings;

class Sings8TableSeeder extends Seeder {

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run() {
        $sing = [
            [
                'url' => '',
                'numeral' => '',
                'title' => '8. Знаки дополнительной информации',
                'text' => 'Знаки дополнительной информации (таблички) уточняют или ограничивают 
                    действие знаков, с которыми они применены, либо содержат иную информацию 
                    для участников дорожного движения.' ,
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.1.1.png',
                'numeral' => '8.1.1',
                'title' => 'Расстояние до объекта',
                'text' => 'Указывает расстояние от знака до начала опасного участка, места '
                . 'введения соответствующего ограничения или определенного объекта (места), '
                . 'находящегося впереди по ходу движения.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.1.2.png',
                'numeral' => '8.1.2',
                'title' => 'Расстояние до объекта',
                'text' => 'Указывает расстояние от знака 2.4  до перекрестка в случае, если '
                . 'непосредственно перед перекрестком установлен знак 2.5. ',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.1.3.png',
                'numeral' => '8.1.3',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.1.4.png',
                'numeral' => '8.1.4',
                'title' => 'Расстояние до объекта',
                'text' => 'Указывают расстояние до объекта, находящегося в стороне от дороги.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.2.1.png',
                'numeral' => '8.2.1',
                'title' => 'Зона действия',
                'text' => 'Указывает протяженность опасного участка дороги, обозначенного '
                . 'предупреждающими знаками, или зону действия запрещающих знаков, а также '
                . 'знаков 5.16, 6.2 и 6.4.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.2.2.png',
                'numeral' => '8.2.2',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.2.3.png',
                'numeral' => '8.2.3',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.2.4.png',
                'numeral' => '8.2.4',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.2.5.png',
                'numeral' => '8.2.5',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.2.6.png',
                'numeral' => '8.2.6',
                'title' => 'Зона действия',
                'text' => '8.2.2 указывает зону действия запрещающих знаков 3.27 — 3.30; 8.2.3 '
                . 'указывает конец зоны действия знаков 3.27 — 3.30; 8.2.4 информирует водителей '
                . 'о нахождении их в зоне действия знаков 3.27 — 3.30; 8.2.5, 8.2.6 указывают '
                . 'направление и зону действия знаков 3.27 — 3.30 при запрещении остановки или '
                . 'стоянки вдоль одной стороны площади, фасада здания и тому подобного.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.3.1.png',
                'numeral' => '8.3.1',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.3.2.png',
                'numeral' => '8.3.2',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.3.3.png',
                'numeral' => '8.3.3',
                'title' => 'Направления действия',
                'text' => 'Указывают направления действия знаков, установленных перед перекрестком, '
                . 'или направления движения к обозначенным объектам, '
                . 'находящимся непосредственно у дороги.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.1.png',
                'numeral' => '8.4.1',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.2.png',
                'numeral' => '8.4.2',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.3.png',
                'numeral' => '8.4.3',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.3.1.png',
                'numeral' => '8.4.3.1',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.4.png',
                'numeral' => '8.4.4',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.5.png',
                'numeral' => '8.4.5',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.6.png',
                'numeral' => '8.4.6',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.7.png',
                'numeral' => '8.4.7',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.8.png',
                'numeral' => '8.4.8',
                'title' => 'Вид транспортного средства',
                'text' => 'Указывают вид транспортного средства, на который распространяется действие знака. '
                . '<p>Табличка 8.4.1 распространяет действие знака на грузовые автомобили, в том '
                . 'числе с прицепом, с разрешенной максимальной массой более 3,5 т, '
                . 'табличка 8.4.3 — на легковые автомобили, а также грузовые автомобили '
                . 'с разрешенной максимальной массой до 3,5 т, табличка 8.4.3.1 - на электромобили '
                . 'и гибридные автомобили, имеющие возможность зарядки от внешнего источника, '
                . 'табличка 8.4.8 — на транспортные средства, оборудованные опознавательными '
                . 'знаками (информационными табличками) "Опасный груз".</p>',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.9.png',
                'numeral' => '8.4.9',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.10.png',
                'numeral' => '8.4.10',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.11.png',
                'numeral' => '8.4.11',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.12.png',
                'numeral' => '8.4.12',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.13.png',
                'numeral' => '8.4.13',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.14.png',
                'numeral' => '8.4.14',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.4.15.png',
                'numeral' => '8.4.15',
                'title' => 'Кроме вида транспортного средства',
                'text' => '8.4.9 - 8.4.15 указывают вид транспортного средства, на '
                . 'который не распространяется действие знака. '
                . '<p>Табличка 8.4.14 не распространяет действие знака на транспортные '
                . 'средства, используемые в качестве легкового такси.</p>',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.5.1.png',
                'numeral' => '8.5.1',
                'title' => 'Субботние, воскресные и праздничные дни',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.5.2.png',
                'numeral' => '8.5.2',
                'title' => 'Рабочие дни',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.5.3.png',
                'numeral' => '8.5.3',
                'title' => 'Дни недели',
                'text' => 'Указывают дни недели, в течение которых действует знак.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.5.4.png',
                'numeral' => '8.5.4',
                'title' => 'Время действия',
                'text' => 'Указывает время суток, в течение которого действует знак.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.5.5.png',
                'numeral' => '8.5.5',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.5.6.png',
                'numeral' => '8.5.6',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.5.7.png',
                'numeral' => '8.5.7',
                'title' => 'Время действия',
                'text' => 'Указывают дни недели и время суток, в течение которых действует знак.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.6.1.png',
                'numeral' => '8.6.1',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.6.2.png',
                'numeral' => '8.6.2',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.6.3.png',
                'numeral' => '8.6.3',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.6.4.png',
                'numeral' => '8.6.4',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.6.5.png',
                'numeral' => '8.6.5',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.6.6.png',
                'numeral' => '8.6.6',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.6.7.png',
                'numeral' => '8.6.7',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.6.8.png',
                'numeral' => '8.6.8',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.6.9.png',
                'numeral' => '8.6.9',
                'title' => 'Способ постановки транспортного средства на стоянку',
                'text' => '8.6.1 указывает, что все транспортные средства должны быть поставлены на стоянку '
                . 'параллельно краю проезжей части; 8.6.2 — 8.6.9 указывают способ постановки '
                . 'легковых автомобилей и мотоциклов на околотротуарной стоянке. ',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.7.png',
                'numeral' => '8.7',
                'title' => 'Стоянка с неработающим двигателем',
                'text' => 'Указывает, что на стоянке, обозначенной знаком 6.4 , разрешается '
                . 'стоянка транспортных средств только с неработающим двигателем.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.8.png',
                'numeral' => '8.8',
                'title' => 'Платные услуги',
                'text' => 'Указывает, что услуги предоставляются только за плату.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.9.png',
                'numeral' => '8.9',
                'title' => 'Ограничение продолжительности стоянки',
                'text' => 'Указывает максимальную продолжительность пребывания транспортного '
                . 'средства на стоянке, обозначенной знаком 6.4. ',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.9.1.png',
                'numeral' => '8.9.1',
                'title' => 'Стоянка только для владельцев парковочных разрешений',
                'text' => 'Указывает, что на парковке, обозначенной знаком 6.4 , могут размещаться '
                . 'только транспортные средства, владельцы которых имеют разрешение на парковку, '
                . 'полученное в установленном органами исполнительной власти субъекта '
                . 'Российской Федерации или органами местного самоуправления порядке и '
                . 'действующее в пределах территории, границы которой установлены '
                . 'соответствующими органами исполнительной власти субъекта Российской '
                . 'Федерации или органами местного самоуправления.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.9.2.png',
                'numeral' => '8.9.2',
                'title' => 'Стоянка только транспортных средств дипломатического корпуса',
                'text' => 'Указывает, что на парковке (парковочном месте), обозначенной знаком '
                . '6.4, могут размещаться только транспортные средства аккредитованных '
                . 'дипломатических представительств, консульских учреждений, '
                . 'международных (межгосударственных) организаций и представительств таких '
                . 'организаций, имеющие государственные регистрационные знаки, применяемые '
                . 'для обозначения таких транспортных средств.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.10.png',
                'numeral' => '8.10',
                'title' => 'Место для осмотра автомобилей',
                'text' => 'Указывает, что на площадке, обозначенной знаком 6.4  или 7.11 , '
                . 'имеется эстакада или смотровая канава.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.11.png',
                'numeral' => '8.11',
                'title' => 'Ограничение разрешенной максимальной массы',
                'text' => 'Указывает, что действие знака распространяется только на транспортные '
                . 'средства с разрешенной максимальной массой, превышающей максимальную '
                . 'массу, указанную на табличке.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.12.png',
                'numeral' => '8.12',
                'title' => 'Опасная обочина',
                'text' => 'Предупреждает, что съезд на обочину опасен в связи с проведением '
                . 'на ней ремонтных работ. Применяется со знаком 1.25.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.13.png',
                'numeral' => '8.13',
                'title' => 'Направление главной дороги',
                'text' => 'Указывает направление главной дороги на перекрестке.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.14.png',
                'numeral' => '8.14',
                'title' => 'Полоса движения',
                'text' => 'Указывает полосу движения или полосу для велосипедистов, '
                . 'на которую распространяется действие знака или светофора.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.15.png',
                'numeral' => '8.15',
                'title' => 'Слепые пешеходы',
                'text' => 'Указывает, что пешеходным переходом пользуются слепые. '
                . 'Применяется со знаками 1.22, 5.19.1, 5.19.2 и светофорами.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.16.png',
                'numeral' => '8.16',
                'title' => 'Влажное покрытие',
                'text' => 'Указывает, что действие знака распространяется на период времени, '
                . 'когда покрытие проезжей части влажное.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.17.png',
                'numeral' => '8.17',
                'title' => 'Инвалиды',
                'text' => 'Указывает, что действие знака 6.4  распространяется только на '
                . 'мотоколяски и автомобили, на которых установлен опознавательный знак "Инвалид".',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.18.png',
                'numeral' => '8.18',
                'title' => 'Кроме инвалидов',
                'text' => 'Указывает, что действие знака не распространяется на мотоколяски '
                . 'и автомобили, на которых установлен опознавательный знак "Инвалид".',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.19.png',
                'numeral' => '8.19',
                'title' => 'Класс опасного груза',
                'text' => 'Указывает номер класса (классов) опасных грузов по ГОСТу 19433-88.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.20.1.png',
                'numeral' => '8.20.1',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.20.2.png',
                'numeral' => '8.20.2',
                'title' => 'Тип тележки транспортного средства',
                'text' => 'Применяются со знаком 3.12.  Указывают число сближенных осей '
                . 'транспортного средства, для каждой из которых указанная на знаке масса '
                . 'является предельно допустимой.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.21.1.png',
                'numeral' => '8.21.1',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.21.2.png',
                'numeral' => '8.21.2',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.21.3.png',
                'numeral' => '8.21.3',
                'title' => 'Вид маршрутного транспортного средства',
                'text' => 'Применяются со знаком 6.4.  Обозначают место стоянки транспортных '
                . 'средств у станций метро, остановок автобуса (троллейбуса) или трамвая, '
                . 'где возможна пересадка на соответствующий вид транспорта.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.22.1.png',
                'numeral' => '8.22.1',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.22.2.png',
                'numeral' => '8.22.2',
                'title' => '',
                'text' => '',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.22.3.png',
                'numeral' => '8.22.3',
                'title' => 'Препятствие',
                'text' => 'Обозначают препятствие и направление его объезда. '
                . 'Применяются со знаками 4.2.1 — 4.2.3.',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.23.png',
                'numeral' => '8.23',
                'title' => 'Фотовидеофиксация',
                'text' => 'Применяется со знаками 1.1, 1.2, 1.8, 1.22, 1.35, 3.1 — 3.7, 3.18.1, '
                . '3.18.2, 3.19, 3.20, 3.22, 3.24, 3.27 — 3.30, 5.1 — 5.4, 5.14, 5.21, 5.23.1, 5.23.2'
                . ', 5.24.1, 5.24.2, 5.25 — 5.27, 5.31, 5.35 и 5.36, а также со светофорами. '
                . 'Указывает, что в зоне действия дорожного знака либо на данном участке '
                . 'дороги может осуществляться фиксация административных правонарушений '
                . 'работающими в автоматическом режиме специальными техническими средствами, '
                . 'имеющими функции фото-, киносъемки и видеозаписи, или средствами фото-, '
                . 'киносъемки и видеозаписи. ',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.24.png',
                'numeral' => '8.24',
                'title' => 'Работает эвакуатор',
                'text' => 'Указывает, что в зоне действия дорожных знаков 3.27 — 3.30 осуществляется '
                . 'задержание транспортного средства. '
                . '<p>Таблички размещаются непосредственно под знаком, с которым они применены. '
                . 'Таблички 8.2.2 — 8.2.4, 8.13 при расположении знаков над проезжей частью, '
                . 'обочиной или тротуаром размещаются сбоку от знака.</p>',
                'sing_id' => 8
            ],
            [
                'url' => '',
                'numeral' => '',
                'title' => '',
                'text' => 'Желтый фон на знаках 1.8, 1.15, 1.16, 1.18 — 1.21, 1.33, 2.6, 3.11 — 3.16, '
                . '3.18.1 — 3.25, установленных в местах производства дорожных работ, означает, '
                . 'что эти знаки являются временными. '
                . '<p>В случаях если значения временных дорожных знаков и стационарных '
                . 'дорожных знаков противоречат друг другу, водители должны руководствоваться '
                . 'временными знаками.</p>'
                . '<p>Примечание. Знаки по ГОСТу 10807-78, находящиеся в эксплуатации, действуют '
                . 'до их замены в установленном порядке на знаки по ГОСТу Р 52290-2004.</p>',
                'sing_id' => 8
            ],
            [
                'url' => '/img/signs/8/8.25.png',
                'numeral' => '8.25',
                'title' => 'Экологический класс транспортного средства',
                'text' => 'Указывает, что действие знаков 3.3 - 3.5   , 3.18.1 , 3.18.2  и 4.1.1 - 4.1.6 '
                . 'распространяется на механические транспортные средства:'
                . '<ul>'
                . '<li>экологический класс которых, указанный в регистрационных документах на эти '
                . 'транспортные средства, ниже экологического класса, указанного на табличке.</li>'
                . '</ul>'
                . 'Указывает, что действие знаков 5.29  и 6.4  распространяется на '
                . 'механические транспортные средства:<ul>'
                . '<li>экологический класс которых, указанный в регистрационных документах на эти '
                . 'транспортные средства, соответствует экологическому классу, указанному '
                . 'на табличке, либо выше экологического класса, указанного на табличке.</li>'
                . '</ul>',
                'sing_id' => 8
            ],  

        ];
        
        Sings::insert($sing);
    }

}
