<?php

use Illuminate\Database\Seeder;
use App\SubItems;

class SubItems19TableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
         $subItems = [
            [
                'title' => '19.',
                'text' => 'Пользование внешними световыми приборами и звуковыми сигналами',
                'item_id' => 19
            ],
              [
                'title' => '19.1.',
                'text' => 'В темное время суток и в условиях недостаточной видимости независимо '
                  . 'от освещения дороги, а также в тоннелях на движущемся транспортном '
                  . 'средстве должны быть включены следующие световые приборы:<ul>'
                 .'<li>на всех механических транспортных средствах и мопедах – фары '
                  . 'дальнего или ближнего света, на велосипедах – фары или фонари, '
                  . 'на гужевых повозках – фонари (при их наличии);</li>'
                 . '<li>на прицепах и буксируемых механических транспортных средствах – габаритные огни.
                    (в ред. Постановления Правительства РФ от 24.01.2001 N 67)</li>'
                 . '</ul>',
                'item_id' => 19
            ],
              [
                'title' => '19.2.',
                'text' => 'Дальний свет должен быть переключен на ближний:<ul>'
                 .'<li>в населенных пунктах, если дорога освещена;</li>'
                 . '<li>при встречном разъезде на расстоянии на менее чем за 150 м до '
                  . 'транспортного средства, а также и при большем, если водитель '
                  . 'встречного транспортного средства периодическим переключением '
                  . 'света фар покажет необходимость этого;</li>'
                 . '<li>в любых других случаях для исключения возможности ослепления водителей '
                  . 'как встречных, так и попутных транспортных средств.</li>'
                 . '</ul>'
                  . '<p>При ослеплении водитель должен включить аварийную световую '
                  . 'сигнализацию и, не меняя полосу движения, снизить скорость и остановиться.</p>',
                'item_id' => 19
            ],
              [
                'title' => '19.3.',
                'text' => 'При остановке и стоянке в темное время суток на неосвещенных '
                  . 'участках дорог, а также в условиях недостаточной видимости на '
                  . 'транспортном средстве должны быть включены габаритные огни. '
                  . 'В условиях недостаточной видимости дополнительно к габаритным '
                  . 'огням могут быть включены фары ближнего света, противотуманные '
                  . 'фары и задние противотуманные фонари.',
                'item_id' => 19
            ],
              [
                'title' => '19.4.',
                'text' => 'Противотуманные фары могут использоваться:<ul>'
                 .'<li>в условиях недостаточной видимости с ближним или дальним светом фар;
(в ред. Постановления Правительства РФ от 10.05.2010 N 316)</li>'
                 . '<li>в темное время суток на неосвещенных участках '
                  . 'дорог совместно с ближним или дальним светом фар;</li>'
                 . '<li>вместо ближнего света фар в соответствии с пунктом 19.5 Правил.
(в ред. Постановления Правительства РФ от 10.05.2010 N 316)</li></ul>',
                'item_id' => 19
            ],
              [
                'title' => '19.5.',
                'text' => 'В светлое время суток на всех движущихся транспортных средствах с '
                  . 'целью их обозначения должны включаться фары ближнего света или дневные ходовые огни.',
                'item_id' => 19
            ],
              [
                'title' => '19.6.',
                'text' => 'Фарой-прожектором и фарой-искателем разрешается пользоваться 
                    только вне населенных пунктов при отсутствии встречных транспортных средств. 
                    В населенных пунктах пользоваться такими фарами могут только водители 
                    транспортных средств, оборудованных в установленном порядке проблесковыми 
                    маячками синего цвета и специальными звуковыми сигналами, при выполнении 
                    неотложного служебного задания.
                    (в ред. Постановления Правительства РФ от 21.04.2000 N 370)',
                'item_id' => 19
            ],
              [
                'title' => '19.7.',
                'text' => 'Задние противотуманные фонари могут применяться только в условиях '
                  . 'недостаточной видимости. Запрещается подключать задние противотуманные '
                  . 'фонари к стоп-сигналам.',
                'item_id' => 19
            ],
              [
                'title' => '19.8.',
                'text' => 'Опознавательный знак «Автопоезд» должен быть включен при движении '
                  . 'автопоезда, а в темное время суток и в условиях недостаточной видимости, '
                  . 'кроме того, и на время его остановки или стоянки.',
                'item_id' => 19
            ],
              [
                'title' => '19.9.',
                'text' => 'Исключен с 1 июля 2008 года. - Постановление Правительства РФ от 16.02.2008 N 84.',
                'item_id' => 19
            ],
              [
                'title' => '19.10.',
                'text' => 'Звуковые сигналы могут применяться только:<ul>'
                 .'<li>для предупреждения других водителей о намерении произвести обгон вне населенных пунктов;</li>'
                 . '<li>в случаях, когда это необходимо для предотвращения дорожно-транспортного происшествия.</li>'
                 . '</ul>',
                'item_id' => 19
            ],
             [
                'title' => '19.11.',
                'text' => 'Для предупреждения об обгоне вместо звукового сигнала или совместно с ним может подаваться световой сигнал, представляющий собой кратковременное переключение фар с ближнего на дальний свет.
(п. 19.11 в ред. Постановления Правительства РФ от 10.05.2010 N 316)',
                'item_id' => 19
            ],
          
         ];
         
         SubItems::insert($subItems);
    }
}
